InformationRegisters/ДатаМобайл_ПорционнаяВыгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДатаМобайл_ПорционнаяВыгрузка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТСД</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ДатаМобайл_СписокТСД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ДатаМобайл_ПорционнаяВыгрузка/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьНоменклатуруПодПорционнуюВыгрузку(УзелПО, Значение) Экспорт
	
	Если Значение Тогда
		
		Сообщить("Регистрация товаров под выгрузку...");
		
		//1. Очищаем регистр от возможных данных с других обменов:
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
		//1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		НаборЗаписей.Записать(Истина);  
		
		КоличествоТоваровВПорции = УзелПО.КоличествоТоваровВПорции;
		Если Не ЗначениеЗаполнено(КоличествоТоваровВПорции) Тогда
			КоличествоТоваровВПорции = 1000;
		КонецЕсли;	
		
		//2. Запрашиваем данные:  

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		
		|	Номенклатура.Ссылка КАК ОбъектВыгрузки
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления           
		|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
		|	И (&ВсеТоварыВыбраннойГруппы
		|			ИЛИ Номенклатура.Ссылка В ИЕРАРХИИ (&ВыбраннаяГруппаТоваров))
		|	И НЕ Номенклатура.ЭтоГруппа";                          
		Запрос.УстановитьПараметр("ВыбраннаяГруппаТоваров", УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВсеТоварыВыбраннойГруппы", УзелПО.ДоступныеГруппыТоваров.Количество() = 0);
		Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
		
		Результат = Запрос.Выполнить(); 
		
		//3. Регистрируем под выгрузку:
		
		НомерПакетаДляРегистрации = 1;
		
		ВыборкаДанныхДляРегистрации = Результат.Выбрать();
		КоличествоТоваровВТекущейПорции = 0;
		
		МассивТоваровВПорции = Новый Массив;
		
		//создаем набор записей:  
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		
		Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
			
			//сравниваем настройку с  количеством товаров в текущей порции:	
			
			Если (КоличествоТоваровВТекущейПорции + 1) = КоличествоТоваровВПорции Тогда
				
				МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				
				НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
				//1-товары
				НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
				НаборЗаписей.Прочитать();
				
				Для Каждого ЭлементМассива Из МассивТоваровВПорции Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ТСД = УзелПО;
					НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
					НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
					НоваяЗапись.ТипОбъекта = 1;   
					
				КонецЦикла;
				
				//сбрасываем счетчик товаров в порции:	
				КоличествоТоваровВТекущейПорции = 0;
				//берем номер следующего пакета:
				НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
				//очищаем массив товаров в порции:
				МассивТоваровВПорции.Очистить();
				
				//записываем данные текущей порции:
				НаборЗаписей.Записать(Истина);  
				
			Иначе
				
				МассивТоваровВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				КоличествоТоваровВТекущейПорции = КоличествоТоваровВТекущейПорции + 1;
				
			КонецЕсли;   					
			
		КонецЦикла;	
		
		//записываем остатки последней порции:
		Если МассивТоваровВПорции.Количество() Тогда
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			//1-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
			НаборЗаписей.Прочитать();
			
			Для Каждого ЭлементМассива Из МассивТоваровВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 1;   
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			МассивТоваровВПорции.Очистить();
			
		КонецЕсли;	  		
		
		
		
		Сообщить("Регистрация товаров завершена!");   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		//1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(1);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		
		НаборЗаписей.Записать(Истина);     
		
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ПеререгистрацияПодвисшихПакетовПодВыгрузку(УзелПО) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.НомерПакета
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ПорционнаяВыгрузка КАК ДатаМобайл_ПорционнаяВыгрузка
	|ГДЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД = &ТСД";
	Запрос.УстановитьПараметр("ТСД", УзелПО);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СчетчикНовыхПакетов = 1;
	
	Пока Выборка.Следующий() Цикл    
		
		НаборЗаписейПодвисшегоПакета = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписейПодвисшегоПакета.Отбор.ТСД.Установить(УзелПО);
		НаборЗаписейПодвисшегоПакета.Отбор.НомерПакета.Установить(Выборка.НомерПакета);
		НаборЗаписейПодвисшегоПакета.Прочитать();
		
		НаборЗаписейНовый = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписейНовый.Отбор.ТСД.Установить(УзелПО);
		НаборЗаписейНовый.Отбор.НомерПакета.Установить(СчетчикНовыхПакетов);
		НаборЗаписейНовый.Прочитать();
		НаборЗаписейНовый.Очистить();
		
		Для Каждого Запись Из НаборЗаписейПодвисшегоПакета Цикл
			
			НоваяЗапись = НаборЗаписейНовый.Добавить();	
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
			НоваяЗапись.НомерПакета = СчетчикНовыхПакетов;
			
		КонецЦикла;	
		
		НаборЗаписейНовый.Записать(Истина);
		
		НаборЗаписейПодвисшегоПакета.Очистить();
		НаборЗаписейПодвисшегоПакета.Записать(Истина);
		
		СчетчикНовыхПакетов = СчетчикНовыхПакетов + 1;
		
	КонецЦикла;	
	

	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст =
	"ВЫБРАТЬ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД,
	|	ДатаМобайл_ПорционнаяВыгрузка.НомерПакета,
	|	ДатаМобайл_ПорционнаяВыгрузка.ТипОбъекта,
	|	ДатаМобайл_ПорционнаяВыгрузка.ОбъектВыгрузки
	|ИЗ
	|	РегистрСведений.ДатаМобайл_ПорционнаяВыгрузка КАК ДатаМобайл_ПорционнаяВыгрузка
	|ГДЕ
	|	ДатаМобайл_ПорционнаяВыгрузка.ТСД = &ТСД";
	Запрос.УстановитьПараметр("ТСД", УзелПО);
	
	
	
КонецПроцедуры

Процедура ЗарегистрироватьИзображенияНоменклатурыПодПорционнуюВыгрузку(УзелПО, Значение) Экспорт
	
	Если Значение Тогда
		
		Сообщить("Регистрация изображений товаров под выгрузку...");
		
		//1. Очищаем регистр от возможных данных с других обменов:
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
		//1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		НаборЗаписей.Записать(Истина);  
		
		КоличествоИзображенийВПорции = УзелПО.КоличествоИзображенийВПорции;
		
		Если Не ЗначениеЗаполнено(КоличествоИзображенийВПорции) Тогда
			КоличествоИзображенийВПорции = 10;
		КонецЕсли;	             
		
		//2. Запрашиваем данные:
		
		Запрос = Новый Запрос;	
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Файлы.Ссылка КАК ОбъектВыгрузки
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	НЕ Файлы.ПометкаУдаления
		|	И НЕ Файлы.ВладелецФайла.ПометкаУдаления           
		|	И Файлы.ВладелецФайла.ТипНоменклатуры = &ТипНоменклатуры
		|	И (&ВсеТоварыВыбраннойГруппы
		|			ИЛИ Файлы.ВладелецФайла В ИЕРАРХИИ (&ВыбраннаяГруппаТоваров))";           
		
        Запрос.УстановитьПараметр("ВыбраннаяГруппаТоваров", УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВсеТоварыВыбраннойГруппы", УзелПО.ДоступныеГруппыТоваров.Количество() = 0);
		Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);                         
				
		Результат = Запрос.Выполнить(); 
		
		//3. Регистрируем под выгрузку:
		
		НомерПакетаДляРегистрации = 1;
		
		ВыборкаДанныхДляРегистрации = Результат.Выбрать();
		КоличествоИзображенийНоменклатурыВТекущейПорции = 0;
		
		МассивИзображенийНоменклатурыВПорции = Новый Массив;
		
		//создаем набор записей:  
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		
		Пока ВыборкаДанныхДляРегистрации.Следующий() Цикл 
			
			//сравниваем настройку с  количеством товаров в текущей порции:	
			
			Если (КоличествоИзображенийНоменклатурыВТекущейПорции + 1) = КоличествоИзображенийВПорции Тогда
				
				МассивИзображенийНоменклатурыВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				
				НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
				НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
				//1-товары
				НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
				НаборЗаписей.Прочитать();
				
				Для Каждого ЭлементМассива Из МассивИзображенийНоменклатурыВПорции Цикл
					
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.ТСД = УзелПО;
					НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
					НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
					НоваяЗапись.ТипОбъекта = 2;   
					
				КонецЦикла;
				
				//сбрасываем счетчик товаров в порции:	
				КоличествоИзображенийНоменклатурыВТекущейПорции = 0;
				//берем номер следующего пакета:
				НомерПакетаДляРегистрации = НомерПакетаДляРегистрации + 1;
				//очищаем массив товаров в порции:
				МассивИзображенийНоменклатурыВПорции.Очистить();
				
				//записываем данные текущей порции:
				НаборЗаписей.Записать(Истина);  
				
			Иначе
				
				МассивИзображенийНоменклатурыВПорции.Добавить(ВыборкаДанныхДляРегистрации.ОбъектВыгрузки);
				КоличествоИзображенийНоменклатурыВТекущейПорции = КоличествоИзображенийНоменклатурыВТекущейПорции + 1;
				
			КонецЕсли;   					
			
		КонецЦикла;	
		
		//записываем остатки последней порции:
		Если МассивИзображенийНоменклатурыВПорции.Количество() Тогда
			
			НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
			НаборЗаписей.Отбор.НомерПакета.Установить(НомерПакетаДляРегистрации);
			//1-товары
			НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
			НаборЗаписей.Прочитать();
			
			Для Каждого ЭлементМассива Из МассивИзображенийНоменклатурыВПорции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТСД = УзелПО;
				НоваяЗапись.ОбъектВыгрузки = ЭлементМассива;
				НоваяЗапись.НомерПакета = НомерПакетаДляРегистрации;
				НоваяЗапись.ТипОбъекта = 2;   
				
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			МассивИзображенийНоменклатурыВПорции.Очистить();
			
		КонецЕсли;	  		
		
		Сообщить("Регистрация изображений товаров завершена!");   
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.ДатаМобайл_ПорционнаяВыгрузка.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТСД.Установить(УзелПО); 
		//1-товары
		НаборЗаписей.Отбор.ТипОбъекта.Установить(2);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить(); 
		
		НаборЗаписей.Записать(Истина);     
		
	КонецЕсли;	
	
КонецПроцедуры
